using UnityEngine;
using System.Collections;

public class gameTetrisLogic : MonoBehaviour {


	// Привет! Начинаю писать тест задание. начал в Пятницу в 11:00, пока настроил гит, все дела...
	// Программа будет делиться на несколько пунктов:
	// 1) Генерация доски по правилам тетриса 10х20
	// 2) Создание формы из кубиков
	// 3) Движение формы внизу
	// 4) Входные данные получаемые от пользователя
	// 5) Создания коллизии между блоками и контурами карты (доски, игрового поля)
	// 6) Вращение блоков
	// 7) Проверка на заполненнсоть строки, если строка заполнена - удаляем кубики и сдвиагаем всё вниз
	// 8) Проверка на "Потрачено", если игрок не справился и проиграл
	// 9) Добавление интерфейса
	//
	//*************************************************************************************************
	//
	// Буду заливать по мере добавления методов. Реализацию планирую сделать максимально возможно кодом.

	void Start () {
	
	}

	void Update () {
	
	}
}
